app/controllers/api/v1/events_controller.rb

SELECT "events".* FROM "events" INNER JOIN "event_recipients" ON "events"."id" = "event_recipients"."event_id" WHERE "event_recipients"."recipient_id" = $1  [["recipient_id", 2]]
SELECT "gifts".* FROM "gifts" WHERE "gifts"."recipient_id" = $1  [["recipient_id", 2]]
SELECT "recipients".* FROM "recipients" WHERE "recipients"."id" IN (2, 1)
---
      def index
        render json: current_user.events.includes(:gifts, :recipients), include: ['gifts'], include: ['recipients']

SELECT  "events".* FROM "events" WHERE "events"."user_id" = $1 AND "events"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
      def show
        event = current_user.events.find(params[:id])

INSERT INTO "events" ("date", "title", "description", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", 2016-06-07 04:00:00 UTC], ["title", "Test Event"], ["description", "A test"], ["user_id", 1]]
---
      def create
        event = Event.new(event_params)
        event.user = current_user
        event.save