app/controllers/api/v1/events_controller.rb

      def find_event
        @event = current_user.events.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."user_id" = $1 AND "events"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]