app/controllers/api/v1/gifts_controller.rb

INSERT INTO "gifts" ("name", "url", "price", "priority", "event_id", "recipient_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "shotgun"], ["url", "www.example.com"], ["price", #<BigDecimal:7f894e3e8300,'0.2E3',9(27)>], ["priority", 7], ["event_id", 2], ["recipient_id", 10]]
---
      def create
        gift = Gift.create(gift_params)

DELETE FROM "gifts" WHERE "gifts"."id" = $1  [["id", 7]]
---
      def destroy
        @gift.destroy