app/controllers/api/v1/gifts_controller.rb

SELECT  "gifts".* FROM "gifts" INNER JOIN recipients ON gifts.recipient_id=recipients.id INNER JOIN users ON recipients.user_id = users.id WHERE (users.id = 1) AND "gifts"."id" = $1 ORDER BY gifts.priority LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
      def show
        gift = current_user.gifts.find(params[:id])