app/controllers/api/v1/recipients_controller.rb

      def index
        render json: current_user.recipients.includes(:gifts, :events), include: ['gifts'], include: ['events']
---
SELECT "events".* FROM "events" WHERE "events"."id" IN (3, 1, 2)
SELECT "gifts".* FROM "gifts" WHERE "gifts"."event_id" = $1  [["event_id", 3]]
SELECT "recipients".* FROM "recipients" INNER JOIN "event_recipients" ON "recipients"."id" = "event_recipients"."recipient_id" WHERE "event_recipients"."event_id" = $1  [["event_id", 3]]

      def create
        recipient = Recipient.find_by(name: recipient_name[:name])
        if recipient
          recipient.update(recipient_name)
          render json: recipient
        else
          new_recipient = Recipient.new(recipient_params)
          new_recipient.user = current_user
          new_recipient.save
---
SELECT  "recipients".* FROM "recipients" WHERE "recipients"."name" = $1 LIMIT $2  [["name", "bob the builder"], ["LIMIT", 1]]
UPDATE "recipients" SET "name" = $1 WHERE "recipients"."id" = $2  [["name", "Lucy"], ["id", 1]]
INSERT INTO "recipients" ("name", "user_id") VALUES ($1, $2) RETURNING "id"  [["name", "charliebrown"], ["user_id", 1]]

      def destroy
        @recipient.destroy
---
DELETE FROM "recipients" WHERE "recipients"."id" = $1  [["id", 1]]

      def find_recipient
        @recipient = current_user.recipients.find(params[:id])
---
SELECT  "recipients".* FROM "recipients" WHERE "recipients"."user_id" = $1 AND "recipients"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]